
--교수 테이블에서 부서별 급여 합계와 평균을 구하기
--단, 급여 평균이 400이상인 부서만 출력하기


--교수 테이블에서 부서별 급여 합계와 평균을 구하기 
--평군이 큰순으로 출력하기


--1.전공1별로 가장 큰 키와, 가장 작은 키, 키의 평균을 구하기 평균키가 170이상인  전공1학과를 출력하기


--2.교수테이블에서 급여와 보너스 합계가 가장 많은 값과, 적은값,평균금액 출력하기.
--단, 보너스가 없으면 0으로 처리한다. 평균은 소숫점이하 한자리로 반올림 하여 출력한다.


--3.학과별 평균 급여가 300이상인  학과의 학과코드 ,평균급여, 인원수를  출력하기


--4.주민번호를 기준으로 남학생,여학생의 최대키와 최소키,평균키를 출력하기 평균키는 소숫점이하 2자리로 반올림하여 출력한다.


--5.학생 중 생일(birthday)기준으로 월별로 태어난 인원수를 출력하기 


--6.학생 중 생일(birthday)기준으로 월별로 태어난 인원수를 다음 결과처럼 출력하기


--7.전화번호의 지역번호가 02 서울 031 경기 051 부산 052 경남 ,나머지 그외 지역 학생의 인원수를 조회하기 


--8.전화번호의 지역번호가 02 서울 031 경기 051 부산 052 경남 ,나머지 그외 지역 학생의 인원수를 조회하기 가로출력
